viys/Configuration/Keil5 MDK/stm32/Keil.STM32F3xx_DFP.1.0.1.pdsc
      <!-- *************************  Device 'STM32F303CC'  ***************************** -->
      <device Dname="STM32F303CC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F30x.h"  define="STM32F30x"/>
        <debug      svd="SVD\STM32F30x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F30x_32x_RM.PDF"           title="STM32F30x Series Reference Manual"/>
        <book       name="Documents\STM32F302xB_xC_F303xB_xC.PDF"   title="STM32F30x Data Sheet"/>
        <feature type="ADC"           n="15"      m="12"/>
        <feature type="IOs"           n="37"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F303RB'  ***************************** -->
      <device Dname="STM32F303RB">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F30x.h"  define="STM32F30x"/>
        <debug      svd="SVD\STM32F30x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xA000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F30x_32x_RM.PDF"           title="STM32F30x Series Reference Manual"/>
        <book       name="Documents\STM32F302xB_xC_F303xB_xC.PDF"   title="STM32F30x Data Sheet"/>
        <feature type="ADC"           n="22"      m="12"/>
        <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F303RC'  ***************************** -->
      <device Dname="STM32F303RC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F30x.h"  define="STM32F30x"/>
        <debug      svd="SVD\STM32F30x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F30x_32x_RM.PDF"           title="STM32F30x Series Reference Manual"/>
        <book       name="Documents\STM32F302xB_xC_F303xB_xC.PDF"   title="STM32F30x Data Sheet"/>
        <feature type="ADC"           n="22"      m="12"/>
        <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F303VB'  ***************************** -->
      <device Dname="STM32F303VB">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F30x.h"  define="STM32F30x"/>
        <debug      svd="SVD\STM32F30x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xA000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F30x_32x_RM.PDF"           title="STM32F30x Series Reference Manual"/>
        <book       name="Documents\STM32F302xB_xC_F303xB_xC.PDF"   title="STM32F30x Data Sheet"/>
        <feature type="ADC"           n="39"      m="12"/>
        <feature type="IOs"           n="87"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F303VC'  ***************************** -->
      <device Dname="STM32F303VC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F30x.h"  define="STM32F30x"/>
        <debug      svd="SVD\STM32F30x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F30x_32x_RM.PDF"           title="STM32F30x Series Reference Manual"/>
        <book       name="Documents\STM32F302xB_xC_F303xB_xC.PDF"   title="STM32F30x Data Sheet"/>
        <feature type="ADC"           n="39"      m="12"/>
        <feature type="IOs"           n="87"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      </subFamily>

