viys/Configuration/Keil5 MDK/stm32/Keil.STM32F3xx_DFP.1.0.1.pdsc
      <!-- ************************  Subfamily 'STM32F313'  **************************** -->
      <subFamily DsubFamily="STM32F313">
        <feature type="Timer"         n="9"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="I2S"           n="2"                           name="I2S"/>
        <feature type="USART"         n="5"       m="9000000"         name="USART"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>
      
      <!-- *************************  Device 'STM32F313CC'  ***************************** -->
      <device Dname="STM32F313CC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F30x.h"  define="STM32F30x"/>
        <debug      svd="SVD\STM32F30x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F30x_32x_RM.PDF"           title="STM32F31x Series Reference Manual"/>
        <book       name="Documents\STM32F313xx.PDF"                title="STM32F31x Data Sheet"/>
        <feature type="ADC"           n="15"      m="12"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F313RC'  ***************************** -->
      <device Dname="STM32F313RC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F30x.h"  define="STM32F30x"/>
        <debug      svd="SVD\STM32F30x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F30x_32x_RM.PDF"           title="STM32F31x Series Reference Manual"/>
        <book       name="Documents\STM32F313xx.PDF"                title="STM32F31x Data Sheet"/>
        <feature type="ADC"           n="22"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F313VC'  ***************************** -->
      <device Dname="STM32F313VC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F30x.h"  define="STM32F30x"/>
        <debug      svd="SVD\STM32F30x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F30x_32x_RM.PDF"           title="STM32F31x Series Reference Manual"/>
        <book       name="Documents\STM32F313xx.PDF"                title="STM32F31x Data Sheet"/>
        <feature type="ADC"           n="39"      m="12"/>
        <feature type="IOs"           n="86"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F373'  **************************** -->
      <subFamily DsubFamily="STM32F373">
        <feature type="Timer"         n="9"       m="16"/>
        <feature type="Timer"         n="2"       m="32"/>
        <feature type="DAC"           n="3"       m="12"/>
        <feature type="I2S"           n="3"                           name="I2S"/>
        <feature type="USART"         n="3"       m="9000000"         name="USART"/>
        <feature type="USBD"          n="1"                           name="USB Device"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>
      
      <!-- *************************  Device 'STM32F373C8'  ***************************** -->
      <device Dname="STM32F373C8">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F37x Series Reference Manual"/>
        <book       name="Documents\STM32F372xx_F373xx.PDF"         title="STM32F37x Data Sheet"/>
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="ADC"           n="8"       m="16"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
