viys/Configuration/Keil5 MDK/stm32/Keil.STM32F3xx_DFP.1.0.1.pdsc
      <!-- *************************  Device 'STM32F373CB'  ***************************** -->
      <device Dname="STM32F373CB">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F37x Series Reference Manual"/>
        <book       name="Documents\STM32F372xx_F373xx.PDF"         title="STM32F37x Data Sheet"/>
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="ADC"           n="8"       m="16"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F373CC'  ***************************** -->
      <device Dname="STM32F373CC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F37x Series Reference Manual"/>
        <book       name="Documents\STM32F372xx_F373xx.PDF"         title="STM32F37x Data Sheet"/>
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="ADC"           n="8"       m="16"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F373R8'  ***************************** -->
      <device Dname="STM32F373R8">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F37x Series Reference Manual"/>
        <book       name="Documents\STM32F372xx_F373xx.PDF"         title="STM32F37x Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ADC"           n="8"       m="16"/>
        <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F373RB'  ***************************** -->
      <device Dname="STM32F373RB">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F37x Series Reference Manual"/>
        <book       name="Documents\STM32F372xx_F373xx.PDF"         title="STM32F37x Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ADC"           n="8"       m="16"/>
        <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F373RC'  ***************************** -->
      <device Dname="STM32F373RC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F37x Series Reference Manual"/>
        <book       name="Documents\STM32F372xx_F373xx.PDF"         title="STM32F37x Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ADC"           n="8"       m="16"/>
        <feature type="IOs"           n="52"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F373V8'  ***************************** -->
      <device Dname="STM32F373V8">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F37x Series Reference Manual"/>
        <book       name="Documents\STM32F372xx_F373xx.PDF"         title="STM32F37x Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ADC"           n="21"      m="16"/>
        <feature type="IOs"           n="84"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
        <feature type="BGA"           n="100"                         name="BGA"/>
      </device>
      
