viys/Configuration/Keil5 MDK/stm32/Keil.STM32F3xx_DFP.1.0.1.pdsc
      <!-- *************************  Device 'STM32F373VB'  ***************************** -->
      <device Dname="STM32F373VB">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F37x Series Reference Manual"/>
        <book       name="Documents\STM32F372xx_F373xx.PDF"         title="STM32F37x Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ADC"           n="21"      m="16"/>
        <feature type="IOs"           n="84"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
        <feature type="BGA"           n="100"                         name="BGA"/>
      </device>
      
      <!-- *************************  Device 'STM32F373VC'  ***************************** -->
      <device Dname="STM32F373VC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F37x Series Reference Manual"/>
        <book       name="Documents\STM32F372xx_F373xx.PDF"         title="STM32F37x Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ADC"           n="21"      m="16"/>
        <feature type="IOs"           n="84"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
        <feature type="BGA"           n="100"                         name="BGA"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F383'  **************************** -->
      <subFamily DsubFamily="STM32F383">
        <feature type="Timer"         n="9"       m="16"/>
        <feature type="Timer"         n="2"       m="32"/>
        <feature type="DAC"           n="3"       m="12"/>
        <feature type="I2S"           n="3"                           name="I2S"/>
        <feature type="USART"         n="3"       m="9000000"         name="USART"/>
        <feature type="VCC"           n="1.80"    m="3.60"/>
      
      <!-- *************************  Device 'STM32F383CC'  ***************************** -->
      <device Dname="STM32F383CC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F38x Series Reference Manual"/>
        <book       name="Documents\STM32F383xx.PDF"                title="STM32F38x Data Sheet"/>
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="ADC"           n="7"       m="16"/>
        <feature type="IOs"           n="35"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F383RC'  ***************************** -->
      <device Dname="STM32F383RC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F38x Series Reference Manual"/>
        <book       name="Documents\STM32F383xx.PDF"                title="STM32F38x Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ADC"           n="7"       m="16"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
        <feature type="CSP"           n="66"                          name="CSP"/>
      </device>
      
      <!-- *************************  Device 'STM32F383VC'  ***************************** -->
      <device Dname="STM32F383VC">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\STM32F37x.h"  define="STM32F37x"/>
        <debug      svd="SVD\STM32F37x.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F3xx_256.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash\STM32F3xx_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book       name="Documents\STM32F37x_38x_RM.PDF"           title="STM32F38x Series Reference Manual"/>
        <book       name="Documents\STM32F383xx.PDF"                title="STM32F38x Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ADC"           n="20"      m="16"/>
        <feature type="IOs"           n="83"                          name="Inputs/Outputs"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
        <feature type="BGA"           n="100"                         name="BGA"/>
      </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F30x">
      <description>STMicroelectronics STM32F3 Series devices</description>
      <accept Dname="STM32F30*"/>
      <accept Dname="STM32F31*"/>
    </condition>
    <condition id="STM32F37x">
      <description>STMicroelectronics STM32F31x Devices</description>
      <accept Dname="STM32F37*"/>
      <accept Dname="STM32F38*"/>
    </condition>

