viys/Configuration/Keil5 MDK/stm32/Keil.STM32F3xx_DFP.1.0.1.pdsc
    <condition id="STM32F3xx CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>STMicroelectronics STM32F3 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F3????"/>
    </condition>

  </conditions>

  <examples>
    <example name="Blinky" doc="Abstract.txt" folder="Boards\ST\STM32F3-Discovery\Blinky">
      <description>Blinky example</description>
      <board name="STM32F3-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\ST\STM32F3-Discovery\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="STM32F3-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32F3xx CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for STMicroelectronics STM32F3 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_STM32F3xx    /* Device Startup for STM32F3 */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>

        <!-- header files -->
        <file category="header" condition="STM32F30x" name="Device\Include\stm32f30x.h"/>
        <file category="header" condition="STM32F37x" name="Device\Include\stm32f37x.h"/>
        
        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F3xx_OPT.s"           attr="template"  select="Flash Option Bytes Template"/>

        <!-- startup files -->
        <file category="source" condition="STM32F30x" name="Device\Source\ARM\startup_stm32f30x.s" attr="config"/>
        <file category="source" condition="STM32F37x" name="Device\Source\ARM\startup_stm32f37x.s" attr="config"/>

        <!-- system file -->
        <file category="source" condition="STM32F30x" name="Device\Source\system_stm32f30x.c" attr="config"/>
        <file category="source" condition="STM32F37x" name="Device\Source\system_stm32f37x.c" attr="config"/>
        
      </files>
    </component>
    
  </components>
</package>
